/*Фото галлерея

Давайте сделаем фотогалерея
у нас есть эндпоинт (https://jsonplaceholder.typicode.com/photos)  который возвращает массив фото
у каждого элемента есть albumId сгруппировать фото по этим параметрам и создать соответствующий альбом на странице затем альбом с другим  albumId и тд
изображения должны быть из thumbnailUrl
если изображение не может быть загружено то применить дефолтную картинку (на свой вкус)
при нажатии на соответствующую картинку должно открыться модальное окно с полным изображением которое хранится в url (стили так же должны быть) */
